app/views/pages/chat_room.html.erb

  <div class= "well" id="chatbox" name="chatDiv" style= "height:250px; border: solid 1px #222222; overflow-y: scroll">
    <% @room.messages.each do |message| %>
---
SELECT "messages".* FROM "messages" WHERE "messages"."chat_room_id" = ?  [["chat_room_id", 1]]

          bold.appendChild(name);
          var message = document.createTextNode(": "+body);      // Create a text node
---
INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at", "chat_room_id") VALUES (?, ?, ?, ?, ?)  [["body", "o"], ["user_id", 4], ["created_at", "2019-05-07 20:30:26.116676"], ["updated_at", "2019-05-07 20:30:26.116676"], ["chat_room_id", 1]]