app/channels/chat_channel.rb

INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at", "chat_room_id") VALUES (?, ?, ?, ?, ?)  [["body", "123"], ["user_id", 7], ["created_at", "2019-05-08 09:30:12.127597"], ["updated_at", "2019-05-08 09:30:12.127597"], ["chat_room_id", 1]]
---
  def receive(data)
    @message = Message.new
    @message.chat_room_id=data["chat_room_id"]
    @message.user_id=data["user_id"]
    @message.body=data["body"]
    @message.save