app/controllers/pages_controller.rb

SELECT "messages".* FROM "messages"
---
  def home
    @messages= Message.all

SELECT "chat_rooms".* FROM "chat_rooms" WHERE (title like '%t%')
SELECT "chat_rooms".* FROM "chat_rooms"
---
  def rooms
    if(params.has_key?(:search))
      @rooms=ChatRoom.all.where("title like '%"+params[:search]+"%'")
    else
      @rooms=ChatRoom.all

SELECT  "chat_rooms".* FROM "chat_rooms" WHERE "chat_rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "chat_rooms" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "TestRoom"], ["user_id", 4], ["created_at", "2019-05-08 10:11:07.431432"], ["updated_at", "2019-05-08 10:11:07.431432"]]
INSERT INTO "messages" ("user_id", "created_at", "updated_at", "chat_room_id") VALUES (?, ?, ?, ?)  [["user_id", 5], ["created_at", "2019-05-09 20:47:42.169690"], ["updated_at", "2019-05-09 20:47:42.169690"], ["chat_room_id", 8]]
---
  def chat_room
    @room=ChatRoom.find_by(:id=>params[:id])
    @message=Message.new

    # @current_user=User.find_by(:id=>current_user.id)

      if(params.has_key?(:message))
        @message=Message.new
        @message.body=params[:message]
        @message.user=current_user
        @message.chat_room=@room
        @message.save

INSERT INTO "chat_rooms" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "title"], ["user_id", 4], ["created_at", "2019-05-07 18:33:45.958590"], ["updated_at", "2019-05-07 18:33:45.958590"]]
---
  def new_room
    @room = ChatRoom.new
    @room.title=params[:title]
    @room.user_id=@current_user.__id__
    respond_to do |format|
      if @room.save